#include "main_window.h"
//#include "gtest/gtest.h"
#include <QApplication>
#include <QPoint>
#include <iostream>

int main(int argc, char *argv[]) {
    std::vector<std::string> map = {
            "############################",
            "#............##............#",
            "#.####.#####.##.#####.####.#",
            "#o####.#####.##.#####.####o#",
            "#.####.#####.##.#####.####.#",
            "#..........................#",
            "#.####.##.########.##.####.#",
            "#.####.##.########.##.####.#",
            "#......##....##....##......#",
            "######.##### ## #####.######",
            "######.##### ## #####.######",
            "######.##          ##.######",
            "######.## ######## ##.######",
            "######.## ######## ##.######",
            "######.##          ##.######",
            "######.## ######## ##.######",
            "######.## ######## ##.######",
            "......   #          #   .....",
            "######.## ######## ##.######",
            "######.## ######## ##.######",
            "######.##          ##.######",
            "######.## ######## ##.######",
            "######.## ######## ##.######",
            "#............##............#",
            "#.####.#####.##.#####.####.#",
            "#.####.#####.##.#####.####.#",
            "#o..##................##..o#",
            "###.##.##.########.##.##.###",
            "###.##.##.########.##.##.###",
            "#......##....##....##......#",
            "#.##########.##.##########.#",
            "#.##########.##.##########.#",
            "#..........................#",
            "############################"
    };

    std::vector<std::vector<int>> matrix;

    for (const std::string &row: map) {
        std::vector<int> matrixRow;
        for (char ch: row) {
            if (ch == '#')
                matrixRow.push_back(1);
            else
                matrixRow.push_back(0);
        }
        matrix.push_back(matrixRow);
    }

    // Вывод матрицы
    for (const std::vector<int> &row: matrix) {
        int first = 0;
        for (int cell: row) {
            if (first) {
                std::cout << ", ";
            } else {
                std::cout << "{";
                first = 1;
            }
            std::cout << cell;
        }
        std::cout << "},";
        std::cout << std::endl;
    }
    //    ::testing::InitGoogleTest(&argc, argv);
    //    return RUN_ALL_TESTS();
    QApplication app(argc, argv);
    MainWindow window;
    window.show();
    return QApplication::exec();
}



